modified:   .gitignore 	modified:   Data/README.md 	modified:   Data/crawl_fit_pdfs.py 	modified:   back-end/.env.example 	modified:   back-end/app/api/routes.py 	renamed:    back-end/app/core/config.py -> back-end/app/config/config.py 	new file:   back-end/app/config/prompts.py 	modified:   back-end/app/core/dependencies.py 	new file:   back-end/app/core/memory_agent.py 	modified:   back-end/app/core/prompts.py 	deleted:    back-end/app/memory.py 	modified:   back-end/app/rag/agent.py 	modified:   back-end/app/rag/generator.py 	modified:   back-end/app/storage/memory.py 	modified:   back-end/requirements.txt 	modified:   docs/rag_chatbot_architecture.drawio 	modified:   readme.md
